docs/rosetta-stone.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-16 Thu 18:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rosetta-stone</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/zeroorone/style.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<header>
                          <nav class='breadcrumb'>
 			    <a href='/zeroorone/index.html'>Home</a>
                            <span class='breadcrumb-sep'>/</span>
                            <span class='breadcrumb-current'>rosetta-stone</span>
                          </nav>
                          <div class='controls'>
                            <button class='sidebar-toggle' title='Search'>
                              <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                <path fill-rule='evenodd' clip-rule='evenodd' d='M18.319 14.4326C20.7628 11.2941 20.542 6.75347 17.6569 3.86829C14.5327 0.744098 9.46734 0.744098 6.34315 3.86829C3.21895 6.99249 3.21895 12.0578 6.34315 15.182C9.22833 18.0672 13.769 18.2879 16.9075 15.8442C16.921 15.8595 16.9351 15.8745 16.9497 15.8891L21.1924 20.1317C21.5829 20.5223 22.2161 20.5223 22.6066 20.1317C22.9971 19.7412 22.9971 19.1081 22.6066 18.7175L18.364 14.4749C18.3493 14.4603 18.3343 14.4462 18.319 14.4326ZM16.2426 5.28251C18.5858 7.62565 18.5858 11.4246 16.2426 13.7678C13.8995 16.1109 10.1005 16.1109 7.75736 13.7678C5.41421 11.4246 5.41421 7.62565 7.75736 5.28251C10.1005 2.93936 13.8995 2.93936 16.2426 5.28251Z' fill='currentColor'/>
                              </svg>
                            </button>

                            <button class='theme-toggle' title='Toggle Theme'>
                              <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                <path d='M12 16C14.2091 16 16 14.2091 16 12C16 9.79086 14.2091 8 12 8V16Z' fill='currentColor'/>
                                <path fill-rule='evenodd' clip-rule='evenodd' d='M12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2ZM12 4V8C9.79086 8 8 9.79086 8 12C8 14.2091 9.79086 16 12 16V20C16.4183 20 20 16.4183 20 12C20 7.58172 16.4183 4 12 4Z' fill='currentColor'/>
                              </svg>
                            </button>

                            <button class='toc-toggle' title='Table of Contents'>
                              <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                <path d='M2 6C2 5.44772 2.44772 5 3 5H21C21.5523 5 22 5.44772 22 6C22 6.55228 21.5523 7 21 7H3C2.44772 7 2 6.55228 2 6Z' fill='currentColor'/>
                                <path d='M2 12.0322C2 11.4799 2.44772 11.0322 3 11.0322H21C21.5523 11.0322 22 11.4799 22 12.0322C22 12.5845 21.5523 13.0322 21 13.0322H3C2.44772 13.0322 2 12.5845 2 12.0322Z' fill='currentColor'/>
                                <path d='M3 17.0645C2.44772 17.0645 2 17.5122 2 18.0645C2 18.6167 2.44772 19.0645 3 19.0645H21C21.5523 19.0645 22 18.6167 22 18.0645C22 17.5122 21.5523 17.0645 21 17.0645H3Z' fill='currentColor'/>
                              </svg>
                            </button>
                          </div>
                        </header>

                        <aside id='left-sidebar'>
                          <div class='sidebar-header'>
                            <h3>Search & Tags</h3>
                            <button class='sidebar-close' title='Close'>
                              <svg width='20' height='20' viewBox='0 0 15 15' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                <path fill-rule='evenodd' clip-rule='evenodd' d='M11.7816 4.03157C12.0062 3.80702 12.0062 3.44295 11.7816 3.2184C11.5571 2.99385 11.193 2.99385 10.9685 3.2184L7.50005 6.68682L4.03164 3.2184C3.80708 2.99385 3.44301 2.99385 3.21846 3.2184C2.99391 3.44295 2.99391 3.80702 3.21846 4.03157L6.68688 7.49999L3.21846 10.9684C2.99391 11.193 2.99391 11.557 3.21846 11.7816C3.44301 12.0061 3.80708 12.0061 4.03164 11.7816L7.50005 8.31316L10.9685 11.7816C11.193 12.0061 11.5571 12.0061 11.7816 11.7816C12.0062 11.557 12.0062 11.193 11.7816 10.9684L8.31322 7.49999L11.7816 4.03157Z' fill='currentColor'/>
                              </svg>
                            </button>
                          </div>
                          <div class='search-container'>
                            <input type='text' id='sidebar-search' placeholder='Search full content or #tags...' autocomplete='off'>
                          </div>
                          <div id='sidebar-tags' class='tag-cloud'></div>
                          <ul id='sidebar-results'></ul>
                        </aside>
</div>
<div id="content" class="content">
<h1 class="title">rosetta-stone</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org44549b9">Variables &amp; Typing</a>
<ul>
<li>
<ul>
<li><a href="#org3deccc0">Python Implementation</a></li>
<li><a href="#org395a28d">Bash Implementation</a></li>
<li><a href="#org91fb7ee">Go Implementation</a></li>
<li><a href="#org25f5c5e">Exceptions &amp; Paradigm Shifts</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8be13aa">Control Flow (If / Else)</a>
<ul>
<li>
<ul>
<li><a href="#orgf52f940">Python Implementation</a></li>
<li><a href="#orgbc66909">Bash Implementation</a></li>
<li><a href="#orgb20eb2d">Go Implementation</a></li>
<li><a href="#orgbc6b8fb">Exceptions &amp; Paradigm Shifts</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org44549b9" class="outline-2">
<h2 id="org44549b9">Variables &amp; Typing</h2>
<div class="outline-text-2" id="text-org44549b9">
<p>
How we declare, store, and modify data in memory, and how the language tracks the "type" of that data.
</p>
</div>
<div id="outline-container-org3deccc0" class="outline-4">
<h4 id="org3deccc0">Python Implementation</h4>
<div class="outline-text-4" id="text-org3deccc0">
<p>
Python uses dynamic typing. The interpreter figures out the type at runtime based on the value you assign.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Declaration and assignment
</span><span style="font-weight: bold; font-style: italic;">name</span> = <span style="font-style: italic;">"Elliot"</span>
<span style="font-weight: bold; font-style: italic;">age</span> = 25

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Re-assignment (can even change types)
</span><span style="font-weight: bold; font-style: italic;">age</span> = <span style="font-style: italic;">"Twenty  Five"</span> 

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Constants (No strict enforcement, just convention)
</span><span style="font-weight: bold; font-style: italic;">MAX_CONNECTIONS</span> = 100
</pre>
</div>
</div>
</div>
<div id="outline-container-org395a28d" class="outline-4">
<h4 id="org395a28d">Bash Implementation</h4>
<div class="outline-text-4" id="text-org395a28d">
<p>
Bash treats almost everything as a string unless told otherwise. It is highly dependent on environment variables and exact syntax.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Declaration (NO spaces around the equals sign!)
</span><span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"Elliot"</span>
<span style="font-weight: bold; font-style: italic;">age</span>=55

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Re-assignment
</span><span style="font-weight: bold; font-style: italic;">age</span>=26

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Constants
</span><span style="font-weight: bold;">readonly</span> <span style="font-weight: bold; font-style: italic;">MAX_CONNECTIONS</span>=100

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Usage (Requires the $ prefix to read the value)
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"My name is $name"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org91fb7ee" class="outline-4">
<h4 id="org91fb7ee">Go Implementation</h4>
<div class="outline-text-4" id="text-org91fb7ee">
<p>
Go is statically typed. The compiler must know the type of every variable before the program runs.
</p>

<div class="org-src-container">
<pre class="src src-go">package main

import "fmt"

func main() {
    // Standard declaration with explicit type
    var name string = "Elliot"

    // Short declaration (Type is inferred at compile time)
    age := 25 

    // Re-assignment (Must use = not :=, and must match original type)
    age = 26 

    // Constants
    const maxConnections = 100

    fmt.Println(name, age)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org25f5c5e" class="outline-4">
<h4 id="org25f5c5e">Exceptions &amp; Paradigm Shifts</h4>
<div class="outline-text-4" id="text-org25f5c5e">
<ul class="org-ul">
<li>In Bash, <code>name = "Elliot"</code> will throw an error because Bash thinks <code>name</code> is a command and <code>=</code> is the first argument.</li>
<li>In Python and Bash, you can declare a variable and never use it. If you do this in Go, <b>the program will not compile</b>. Go enforces clean code at the compiler level.</li>
<li>In Go, <code>:=</code> declares a <i>new</i> variable and assigns it. <code>=</code> only assigns a value to an <i>already existing</i> variable. Using <code>:=</code> on a variable that already exists will throw an error.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8be13aa" class="outline-2">
<h2 id="org8be13aa">Control Flow (If / Else)</h2>
<div class="outline-text-2" id="text-org8be13aa">
<p>
Evaluating a boolean condition (True/False) to branch the execution path of the program.
</p>
</div>
<div id="outline-container-orgf52f940" class="outline-4">
<h4 id="orgf52f940">Python Implementation</h4>
<div class="outline-text-4" id="text-orgf52f940">
<p>
Python relies entirely on colons and strict whitespace indentation to define the block of code.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">status_code</span> = 404

<span style="font-weight: bold;">if</span> status_code == 200:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Success"</span>)
<span style="font-weight: bold;">elif</span> status_code == 404:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Not Found"</span>)
<span style="font-weight: bold;">else</span>:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Unknown Error"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc66909" class="outline-4">
<h4 id="orgbc66909">Bash Implementation</h4>
<div class="outline-text-4" id="text-orgbc66909">
<p>
Bash uses bracket syntax for testing conditions. It requires explicit keywords (<code>then</code>, <code>elif</code>, <code>else</code>, and <code>fi</code>) to open and close blocks.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold; font-style: italic;">status_code</span>=404

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Spaces INSIDE the brackets are strictly required
</span><span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"$status_code"</span> -eq 200 ]; <span style="font-weight: bold;">then</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Success"</span>
<span style="font-weight: bold;">elif</span> [ <span style="font-style: italic;">"$status_code"</span> -eq 404 ]; <span style="font-weight: bold;">then</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Not Found"</span>
<span style="font-weight: bold;">else</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Unknown Error"</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb20eb2d" class="outline-4">
<h4 id="orgb20eb2d">Go Implementation</h4>
<div class="outline-text-4" id="text-orgb20eb2d">
<p>
Go drops the parentheses around the condition (unlike C/C++) but enforces strict curly brace placement.
</p>

<div class="org-src-container">
<pre class="src src-go">package main

import "fmt"

func main() {
    statusCode := 404

    if statusCode == 200 {
        fmt.Println("Success")
    } else if statusCode == 404 {
        fmt.Println("Not Found")
    } else {
        fmt.Println("Unknown Error")
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc6b8fb" class="outline-4">
<h4 id="orgbc6b8fb">Exceptions &amp; Paradigm Shifts</h4>
<div class="outline-text-4" id="text-orgbc6b8fb">
<ul class="org-ul">
<li><p>
<b>Go's Initializer Statement:</b> This is a massive paradigm shift from Python. Go allows you to declare a variable <i>inside</i> the <code>if</code> statement itself. The variable is only available inside that specific <code>if/else</code> block. This is how Go handles almost all error checking:
</p>
<div class="org-src-container">
<pre class="src src-go">// Calls a function, assigns the result to err, then immediately checks if err is not nil
if err := processData(); err != nil {
    fmt.Println("Failed:", err)
    // handle error
}
// 'err' no longer exists down here
</pre>
</div></li>

<li><b>Go's Strict Braces:</b> In Go, the opening curly brace <code>{</code> <b>must</b> be on the same line as the <code>if</code> or <code>else</code> keyword. If you press Enter and put the <code>{</code> on the next line, the Go compiler will fail.</li>
<li><b>Bash String vs. Integer Comparisons:</b> Python and Go use <code>==</code> for both strings and numbers. Bash requires different operators. Use <code>-eq</code>, <code>-lt</code>, <code>-gt</code> for numbers, but use <code>=</code> or <code>!=</code> for strings. Example: <code>if [ "$name" = "Elliot" ]; then</code>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Built with Emacs</p>
                         <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/highlight.min.js"></script>
                          <script>
                          window.addEventListener("DOMContentLoaded", () => {
                            document.querySelectorAll("pre.src").forEach(pre => {
                              const classes = Array.from(pre.classList);
                              const langClass = classes.find(c => c.startsWith("src-"));
                              if (!langClass) return;

                              const lang = langClass.replace("src-", "");

                              const code = document.createElement("code");
                              code.className = "language-" + lang;
                              code.textContent = pre.textContent;

                              pre.innerHTML = "";
                              pre.appendChild(code);
                            });

                            hljs.highlightAll();
                          });
                          </script>
</div>
</body>
</html>
